Конфигурация отчетов/Documents/ВводОстатокТовараНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводОстатокТовараНаСкладе</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзминерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедостачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНедостачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация отчетов/Documents/ВводОстатокТовараНаСкладе/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТЧНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ.ТекущаяСтрока;
	ОбновитьДанныеТовара(ТекСтрока);
КонецПроцедуры



&НаКлиенте
Процедура ТЧФактическийОстатокПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ.ТекущаяСтрока;
	ОбновитьДанныеТовара(ТекСтрока);
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполненияТовара()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиТоваровОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток > &КоличествоОстаток";
	
	Запрос.УстановитьПараметр("КоличествоОстаток", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Номенклатура", Выборка.Номенклатура);
		НайденныеСтроки = Объект.ТЧ.НайтиСтроки(Отбор);

		// Проверяем, есть ли строки
		Если НайденныеСтроки.Количество() = 0 Тогда
		    НоваяСтрока = Объект.ТЧ.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		КонецЕсли;
		
	КонецЦикла;
	ОбновитьДанныеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОстатков(Команда)
	ПроверкаЗаполненияТовара();
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеТаблицы()
	Для Каждого Выборка Из Объект.ТЧ Цикл
		ТекСтрока = Выборка.ПолучитьИдентификатор();
		ОбновитьДанныеТовара(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТовара(Индификатор)
	//
	//ЗначениеСтроки = Объект.ТЧ.НайтиПоИдентификатору(Индификатор);
	//ЗначениеСтроки.ШтрихКод = ЗначениеСтроки.Номенклатура.ШтрихКод; 
	//ЗначениеСтроки.ЕдиницаИзминерения = ЗначениеСтроки.Номенклатура.ЕдиницаИзмирения;
	//
	//ЗначениеСтроки.ТекущийОстаток = ПолучениеИнформации.ПолучитьОстаток(ЗначениеСтроки.Номенклатура);
	//
	//ЗначениеСтроки.ЦенаТовара = ПолучениеИнформации.ПолучитьЦену(ЗначениеСтроки.Номенклатура);
	//ЗначениеСтроки.СуммаТовара = ЗначениеСтроки.ФактическийОстаток * ЗначениеСтроки.ЦенаТовара;
	//
	//ЗначениеСтроки.КоличествоНедостачи = ЗначениеСтроки.ТекущийОстаток - ЗначениеСтроки.ФактическийОстаток;
	//ЗначениеСтроки.СуммаНедостачи = ЗначениеСтроки.КоличествоНедостачи * ЗначениеСтроки.ЦенаТовара;

КонецПроцедуры
